## 2.1 Working with pandas : indexing and selection 

---

**data selection in series**

In [ ]:
import pandas as pd
data = pd.Series([25, 50, 75, 100],
                 index=['a', 'b', 'c', 'd'])
data

a     25
b     50
c     75
d    100
dtype: int64

In [ ]:
data['b']

50

We can also use dictionary-like Python expressions and methods to examine the keys/indices and values

In [ ]:
print('if a is in series or not:','a' in data)
print('the data values in the series:',data.keys())

if a is in series or not: True
the data values in the series: Index(['a', 'b', 'c', 'd'], dtype='object')

we can also add an element in the series

In [ ]:
data['e'] = 125
data

a     25
b     50
c     75
d    100
e    125
dtype: int64

**series as one dimension**

*  using slicing property

In [ ]:
print('the series element by the char index:\n',data['a':'c'])
print('the series first two element: \n',data[0:2])

the series element by the char index:
 a    25
b    50
c    75
dtype: int64
the series first two element:
 a    25
b    50
dtype: int64

in the above example we have used the slicing property by the index of char by already assigned

In [ ]:
print('the series first two element: \n',data[0:2])

the series first two element:
 a    25
b    50
dtype: int64

**Indexers: loc, iloc, and ix**

*   Dataframe.loc[ ] : This function is used for labels.
*   Dataframe.iloc[ ] : This function is used for positions or integer based

*   Dataframe.ix[] : This function is used for both label and integer based

In [ ]:
val = pd.Series(['a', 'b', 'c','d','e,'], index=[1, 3, 5,7,9])
val

1     a
3     b
5     c
7     d
9    e,
dtype: object

In [ ]:
print('the first element of the series:',val.loc[1])
print('the first 3 element is :\n',val.loc[1:5])

the first element of the series: a
the first 3 element is :
 1    a
3    b
5    c
dtype: object

In [ ]:
print('the second element in the series:',val.iloc[1])
print('the elements from the second element\n',val.iloc[1:5])

the second element in the series: b
the elements from the second element
 3     b
5     c
7     d
9    e,
dtype: object

**Data Selection in DataFrame**

In [ ]:
area = pd.Series({'Tamil Nadu': 423967, 'Kerala': 695662,
                  'Maharastra': 141297, 'Odisha': 170312,
                  'Delhi': 149995})
pop = pd.Series({'Tamil Nadu': 38332521, 'Kerala': 26448193,
                 'Maharastra': 19651127, 'Odisha': 19552860,
                 'Delhi': 12882135})
lis = pd.DataFrame({'area':area, 'pop':pop})
lis

              area       pop
Tamil Nadu  423967  38332521
Kerala      695662  26448193
Maharastra  141297  19651127
Odisha      170312  19552860
Delhi       149995  12882135

In [ ]:
print('the area of the given states\n',lis['area'])

the area of the given states
 Tamil Nadu    423967
Kerala        695662
Maharastra    141297
Odisha        170312
Delhi         149995
Name: area, dtype: int64

In [ ]:
lis['density']=lis['pop']/lis['area']
lis

              area       pop     density
Tamil Nadu  423967  38332521   90.413926
Kerala      695662  26448193   38.018740
Maharastra  141297  19651127  139.076746
Odisha      170312  19552860  114.806121
Delhi       149995  12882135   85.883763

**dataframe as two dimension**

In [ ]:
lis.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [ ]:
lis.T

           Tamil Nadu        Kerala    Maharastra        Odisha         Delhi
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [ ]:
print('the area of the states',lis.values[0])

the area of the states [4.23967000e+05 3.83325210e+07 9.04139261e+01]

using iloc,loc and ix in two dimension

In [ ]:
print('the area and population of the states:')
lis.iloc[:3, :2]

the area and population of the states:

              area       pop
Tamil Nadu  423967  38332521
Kerala      695662  26448193
Maharastra  141297  19651127

In [ ]:
lis.loc[:'Delhi', :'pop']

              area       pop
Tamil Nadu  423967  38332521
Kerala      695662  26448193
Maharastra  141297  19651127
Odisha      170312  19552860
Delhi       149995  12882135